tap 'caskroom/cask'
tap 'petere/postgresql'
tap 'homebrew/cask-versions'

# tap 'homebrew/bundle'
# tap 'buo/cask-upgrade'

# brew 'brew-cask'

# Main packages
brew 'bash'
brew 'autoconf'
brew 'cairo'
brew 'cloog'
brew 'fontconfig'
brew 'freetype'
brew 'gcc'
brew 'cmake'
brew 'gdbm'
brew 'gettext'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'icu4c'
brew 'isl'
brew 'jpeg'
brew 'libffi'
brew 'libmpc'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'little-cms2'
brew 'mpfr'
brew 'openjpeg'
brew 'openssl'
brew 'pango'
brew 'pixman'
brew 'pkg-config'
brew 'poppler'
brew 'readline'
brew 'ttfautohint'
brew 'wget'
brew 'python'
brew 'geckodriver'        # For Selenium driver
brew 'libiconv'

# Usifull utilites
brew 'pwgen'              # Password generating
brew 'pdf2htmlex'         # PDF to HTML converter
brew 'aria2'              # wget on steroids
brew 'nmap'
brew 'gpg'                # GPG
brew 'ncdu'               # Disk space monitoring from CLI

# VPN
brew 'openconnect'

# DB
brew 'sqlite'
# brew 'postgresql-10.5'
brew 'mysql'
brew 'redis'
brew 'memcached'
brew 'pgbadger' #  PostgreSQL Log Analyzer

# Development
brew 'git'
brew 'git-lfs'
cask 'phantomjs'
brew 'qt'                 # Dependency for capybara-webkit

brew 'glide'              # Vendor Package Management for Golang

# Ruby
brew 'chruby'
brew 'gem_home', args: ['HEAD']
brew 'ruby-build'

#############
# APPS
#############

# Common apps
cask 'xquartz'
cask 'caffeine'
cask 'transmission'
cask 'coffeine'

# Office document
cask 'libreoffice'
# cask 'openoffice'
cask 'evernote'

cask 'disk-inventory-x'   # Disk space analyzer
cask 'the-unarchiver'

# Image processing apps
cask 'skitch'
cask 'gimp'

# Diagrams builder
cask 'dia'
cask 'mysqlworkbench'
cask 'omnigraffle'        # Commercial

# Video processing apps
cask 'vlc'
cask 'handbrake'          # Video converter

# Communication apps
cask 'google-hangouts'
cask 'skype'

# DB management apps
cask 'pgadmin4'
cask 'sequel-pro'

# Development work apps
cask 'rowanj-gitx'
cask 'iterm2'
# cask 'sublime-text'
cask 'textmate'
cask 'wireshark'
cask 'cyberduck'
cask 'apache-directory-studio'
cask 'soapui'

cask 'dnscrypt'           # Securing communications between a client and a DNS resolver.

# Browsers
cask 'chromium'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'

# Virtualization apps
cask 'vagrant'
cask 'virtualbox'

# Chef
cask 'chef/chef/chef-workstation'
